Revit 2024 API
AnalyticalOpening.IsCurveLoopValidForAnalyticalOpening Method
 Checks if curve loop is valid for Analytical Opening.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static bool IsCurveLoopValidForAnalyticalOpening(
	CurveLoop loop,
	Document aDoc,
	ElementId panelId
)
Visual Basic
Public Shared Function IsCurveLoopValidForAnalyticalOpening ( _
	loop As CurveLoop, _
	aDoc As Document, _
	panelId As ElementId _
) As Boolean
Visual C++
public:
static bool IsCurveLoopValidForAnalyticalOpening(
	CurveLoop^ loop,
	Document^ aDoc,
	ElementId^ panelId
)
Parameters
loop
Type: Autodesk.Revit.DB.CurveLoop
 The curve loop to be checked.
aDoc
Type: Autodesk.Revit.DB.Document
 Revit document.
panelId
Type: Autodesk.Revit.DB.ElementId
 ElementId of the AnalyticalPanel on which we create the Opening.
Return Value
 Returns true if curve loop is ok, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalyticalOpening Class
Autodesk.Revit.DB.Structure Namespace